app/controllers/api/v1/causes_controller.rb

            def create
                cause = Cause.new(cause_params)
                if cause.save
---
INSERT INTO "causes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-01-15 16:57:49.269071"], ["updated_at", "2018-01-15 16:57:49.269071"]]

            def destroy
                cause = Cause.find(params[:id])
                cause.destroy
---
DELETE FROM "causes" WHERE "causes"."id" = $1  [["id", 4]]

            def update
                cause = Cause.find(params[:id])
                if cause.update_attributes(cause_params)
---
UPDATE "causes" SET "name" = $1, "story" = $2, "updated_at" = $3 WHERE "causes"."id" = $4  [["name", "Updated name"], ["story", "This is the story of an updated cause"], ["updated_at", "2018-01-15 17:29:26.121968"], ["id", 3]]